solana/runtime-tests/planted-bugs/h1-set-host-pause-skips-assert-admin.patch
Expect: H1: SetHostPause

diff --git a/solana/programs/zama-host/src/instructions/set_host_pause.rs b/solana/programs/zama-host/src/instructions/set_host_pause.rs
index c28ff9c51..fba5901dc 100644
--- a/solana/programs/zama-host/src/instructions/set_host_pause.rs
+++ b/solana/programs/zama-host/src/instructions/set_host_pause.rs
@@ -22,7 +22,6 @@ pub struct HostAdmin<'info> {
 /// Updates the host pause flag.
 pub fn set_host_pause(ctx: Context<HostAdmin>, paused: bool) -> Result<()> {
     assert_no_remaining_accounts(ctx.remaining_accounts)?;
-    assert_admin(&ctx.accounts.host_config, &ctx.accounts.admin)?;
     if ctx.accounts.host_config.paused == paused {
         return Ok(());
     }
